7767517
105 108
Input            input                    0 1 input
Convolution      213                      1 1 input 213 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=432
BatchNorm        214                      1 1 213 214 0=16
ReLU             215                      1 1 214 215
ConvolutionDepthWise 216                      1 1 215 216 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        217                      1 1 216 217 0=16
ReLU             218                      1 1 217 218
Convolution      219                      1 1 218 219 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        220                      1 1 219 220 0=32
ReLU             221                      1 1 220 221
ConvolutionDepthWise 222                      1 1 221 222 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        223                      1 1 222 223 0=32
ReLU             224                      1 1 223 224
Convolution      225                      1 1 224 225 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        226                      1 1 225 226 0=32
ReLU             227                      1 1 226 227
ConvolutionDepthWise 228                      1 1 227 228 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        229                      1 1 228 229 0=32
ReLU             230                      1 1 229 230
Convolution      231                      1 1 230 231 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        232                      1 1 231 232 0=32
ReLU             233                      1 1 232 233
ConvolutionDepthWise 234                      1 1 233 234 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        235                      1 1 234 235 0=32
ReLU             236                      1 1 235 236
Convolution      237                      1 1 236 237 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048
BatchNorm        238                      1 1 237 238 0=64
ReLU             239                      1 1 238 239
ConvolutionDepthWise 240                      1 1 239 240 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        241                      1 1 240 241 0=64
ReLU             242                      1 1 241 242
Convolution      243                      1 1 242 243 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        244                      1 1 243 244 0=64
ReLU             245                      1 1 244 245
ConvolutionDepthWise 246                      1 1 245 246 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        247                      1 1 246 247 0=64
ReLU             248                      1 1 247 248
Convolution      249                      1 1 248 249 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        250                      1 1 249 250 0=64
ReLU             251                      1 1 250 251
Split            splitncnn_0              1 4 251 251_splitncnn_0 251_splitncnn_1 251_splitncnn_2 251_splitncnn_3
Convolution      252                      1 1 251_splitncnn_3 252 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        253                      1 1 252 253 0=8
Convolution      254                      1 1 253 254 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152
BatchNorm        255                      1 1 254 255 0=16
ReLU             256                      1 1 255 256
Convolution      257                      1 1 256 257 0=16 1=3 11=3 2=2 12=2 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=2304
BatchNorm        258                      1 1 257 258 0=16
Convolution      259                      1 1 251_splitncnn_2 259 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        260                      1 1 259 260 0=8
Convolution      261                      1 1 260 261 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152
BatchNorm        262                      1 1 261 262 0=16
ReLU             263                      1 1 262 263
Convolution      264                      1 1 263 264 0=16 1=3 11=3 2=3 12=3 3=1 13=1 4=3 14=3 15=3 16=3 5=0 6=2304
BatchNorm        265                      1 1 264 265 0=16
Convolution      266                      1 1 251_splitncnn_1 266 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        267                      1 1 266 267 0=8
Convolution      268                      1 1 267 268 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        269                      1 1 268 269 0=12
ReLU             270                      1 1 269 270
Convolution      271                      1 1 270 271 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728
BatchNorm        272                      1 1 271 272 0=16
ReLU             273                      1 1 272 273
Convolution      274                      1 1 273 274 0=16 1=3 11=3 2=5 12=5 3=1 13=1 4=5 14=5 15=5 16=5 5=0 6=2304
BatchNorm        275                      1 1 274 275 0=16
Concat           276                      3 1 258 265 275 276 0=0
Convolution      277                      1 1 276 277 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3072
BatchNorm        278                      1 1 277 278 0=64
Convolution      279                      1 1 251_splitncnn_0 279 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        280                      1 1 279 280 0=64
BinaryOp         281                      2 1 278 280 281 0=0
ReLU             282                      1 1 281 282
ConvolutionDepthWise 283                      1 1 282 283 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        284                      1 1 283 284 0=64
ReLU             285                      1 1 284 285
Convolution      286                      1 1 285 286 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        287                      1 1 286 287 0=128
ReLU             288                      1 1 287 288
ConvolutionDepthWise 289                      1 1 288 289 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        290                      1 1 289 290 0=128
ReLU             291                      1 1 290 291
Convolution      292                      1 1 291 292 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        293                      1 1 292 293 0=128
ReLU             294                      1 1 293 294
ConvolutionDepthWise 295                      1 1 294 295 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        296                      1 1 295 296 0=128
ReLU             297                      1 1 296 297
Convolution      298                      1 1 297 298 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        299                      1 1 298 299 0=128
ReLU             300                      1 1 299 300
ConvolutionDepthWise 301                      1 1 300 301 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        302                      1 1 301 302 0=128
ReLU             303                      1 1 302 303
Convolution      304                      1 1 303 304 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        305                      1 1 304 305 0=256
ReLU             306                      1 1 305 306
ConvolutionDepthWise 307                      1 1 306 307 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        308                      1 1 307 308 0=256
ReLU             309                      1 1 308 309
Convolution      310                      1 1 309 310 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        311                      1 1 310 311 0=256
ReLU             312                      1 1 311 312
Pooling          313                      1 1 312 313 0=1 4=1
Reshape          315                      1 1 313 315 0=256
InnerProduct     output                   1 1 315 output 0=2 1=1 2=512
